001001 IDENTIFICATION DIVISION.                                         HELWORLD
001002 PROGRAM-ID. HELLO-WORLD.                                         HELWORLD
001003 PROCEDURE DIVISION.                                              HELWORLD
001004     DISPLAY 'Hello, world'.                                      HELWORLD
001005     STOP RUN.                                                    HELWORLD

