001001 ID DIVISION.                                                    ALT-0000
001002 PROGRAM-ID. HELLO-WORLD.                                        ALT-0000
001003 PROCEDURE DIVISION.                                             ALT-0000
001004     DISPLAY 'Hello, world'.                                     ALT-0000
001005     STOP RUN.                                                   ALT-0000

