001001 IDENTIFICATION DIVISION.                                        SHORTEST
001002 PROGRAM-ID.  ShortestProgram.                                   SHORTEST
001003                                                                 SHORTEST
001004 PROCEDURE DIVISION.                                             SHORTEST
001005 DisplayPrompt.                                                  SHORTEST
001006     DISPLAY "I did it".                                         SHORTEST
001007     STOP RUN.                                                   SHORTEST

