ID DIVISION.
PROGRAM-ID. HELLO-WORLD.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    C02 IS LCP-CH2.
PROCEDURE DIVISION.
    DISPLAY 'Hello, world'.
    STOP RUN.

